app/controllers/lawyers_controller.rb

SELECT "lawyers".* FROM "lawyers"
---
  def index
    @lawyers = Lawyer.all

INSERT INTO "lawyers" ("comments", "created_at", "first_name", "last_name", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @lawyer = Lawyer.new(lawyer_params)

    respond_to do |format|
      if @lawyer.save

DELETE FROM "lawyers" WHERE "lawyers"."id" = ?  [["id", 10]]
---
  def destroy
    @lawyer.destroy

SELECT "lawyers".* FROM "lawyers" WHERE "lawyers"."id" = ? LIMIT 1  [["id", "10"]]
---
    def set_lawyer
      @lawyer = Lawyer.find(params[:id])